000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ЛимитыРучныхСкидокМагазины/ЛимитыРучныхСкидокМагазины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЛимитыРучныхСкидокМагазины</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПериодЛимита</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПричинаРучнойСкидки</name>
    <type>
      <types>CatalogRef.ПричиныРучнойСкидки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

000_РОЗНИЦА_ЦЕНТР/src/AccumulationRegisters/ЛимитыРучныхСкидокМагазины/RecordSetModule.bsl
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ, Замещение)

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	ТекущийПользователь = Пользователи.ТекущийПользователь();

	Для каждого ЗаписьНабора Из ЭтотОбъект Цикл

		ЗаписьНабора.ДатаИзменения = ТекущаяДатаСеанса();
		ЗаписьНабора.Пользователь  = ТекущийПользователь;

	КонецЦикла;

//	---------------------------------------------------------------------------------------

	Если НЕ ПроведениеСервер.РассчитыватьИзменения(ДополнительныеСвойства) Тогда

		Возврат;

	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	БлокироватьДляИзменения = Истина;

//	Текущее состояние набора помещается во временную таблицу "ДвиженияЛимитыРучныхСкидокМагазиныПередЗаписью",
//	чтобы при записи получить изменение нового набора относительно текущего.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаРегистра.ПериодЛимита КАК ПериодЛимита,
	|	ТаблицаРегистра.ПричинаРучнойСкидки КАК ПричинаРучнойСкидки,
	|	ТаблицаРегистра.Магазин КАК Магазин,
	|	ВЫБОР
	|		КОГДА ТаблицаРегистра.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТаблицаРегистра.Сумма
	|		ИНАЧЕ -ТаблицаРегистра.Сумма
	|	КОНЕЦ КАК СуммаПередЗаписью
	|ПОМЕСТИТЬ ДвиженияЛимитыРучныхСкидокМагазиныПередЗаписью
	|ИЗ
	|	РегистрНакопления.ЛимитыРучныхСкидокМагазины КАК ТаблицаРегистра
	|ГДЕ
	|	ТаблицаРегистра.Регистратор = &Регистратор
	|	И НЕ &ЭтоНовый"
	);
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.УстановитьПараметр("ЭтоНовый"   , ДополнительныеСвойства.ЭтоНовый);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Запрос.Выполнить();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ОбменДанными.Загрузка ИЛИ НЕ ПроведениеСервер.РассчитыватьИзменения(ДополнительныеСвойства) Тогда

		Возврат;

	КонецЕсли;

	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;

//	Рассчитывается изменение нового набора относительно текущего с учетом накопленных изменений
//	и помещается во временную таблицу.
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаИзменений.ПериодЛимита КАК ПериодЛимита,
	|	ТаблицаИзменений.ПричинаРучнойСкидки КАК ПричинаРучнойСкидки,
	|	ТаблицаИзменений.Магазин КАК Магазин,
	|	СУММА(ТаблицаИзменений.СуммаИзменение) КАК СуммаИзменение
	|ПОМЕСТИТЬ ДвиженияЛимитыРучныхСкидокМагазиныИзменение
	|ИЗ
	|	(ВЫБРАТЬ
	|		Таблица.ПериодЛимита КАК ПериодЛимита,
	|		Таблица.ПричинаРучнойСкидки КАК ПричинаРучнойСкидки,
	|		Таблица.Магазин КАК Магазин,
	|		Таблица.СуммаПередЗаписью КАК СуммаИзменение
	|	ИЗ
	|		ДвиженияЛимитыРучныхСкидокМагазиныПередЗаписью КАК Таблица
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Таблица.ПериодЛимита,
	|		Таблица.ПричинаРучнойСкидки,
	|		Таблица.Магазин,
	|		ВЫБОР
	|			КОГДА Таблица.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|				ТОГДА -Таблица.Сумма
	|			ИНАЧЕ Таблица.Сумма
	|		КОНЕЦ
	|	ИЗ
	|		РегистрНакопления.ЛимитыРучныхСкидокМагазины КАК Таблица
	|	ГДЕ
	|		Таблица.Регистратор = &Регистратор) КАК ТаблицаИзменений
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаИзменений.ПериодЛимита,
	|	ТаблицаИзменений.ПричинаРучнойСкидки,
	|	ТаблицаИзменений.Магазин
	|
	|ИМЕЮЩИЕ
	|	СУММА(ТаблицаИзменений.СуммаИзменение) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДвиженияЛимитыРучныхСкидокМагазиныПередЗаписью"
//	по Сумма к не правильному состоянию регистра приведет уменьшение прихода и увеличение расхода
	);
	Запрос.УстановитьПараметр("Регистратор", Отбор.Регистратор.Значение);
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;

	Выборка = Запрос.ВыполнитьПакет()[0].Выбрать();
	Выборка.Следующий();
	
//	Добавляется информация о ее существовании и наличии в ней записей об изменении.
	СтруктураВременныеТаблицы.Вставить("ДвиженияЛимитыРучныхСкидокМагазиныИзменение", Выборка.Количество > 0);

КонецПроцедуры
	
#КонецОбласти
